<HTML>

<HEAD>
  <TITLE>Gyurci/Flex's LCD Doku Project Page</TITLE>
</HEAD>

<BODY BGCOLOR="#ffffff">

<table ALIGN=left BORDER=0 WIDTH="100%">
<tr>
<td><A href="../index.html"><IMG border=0 height=22 src="../../pics/html/myhome.jpg" width=22></A></td>
<td align=right><b><FONT SIZE="+3">LCD Doku Project</FONT></b></td>
</tr>
</table>
<br clear="all">

<hr SIZE="3" NOSHADE>


<B><tt>Forr&aacute;sok:</B>&#9;<A href="http://www.gamf.hu/szervezeti/elektro/dolgozoink/madarasz/index.html">Dr. Madar&aacute;sz L&aacute;szl&oacute;</A> okl. villamosm&eacute;rn&ouml;k (RT &Eacute;K `94) engem tan&iacute;tott is...<BR>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<A href="http://www.cen.uiuc.edu/~cburian/lcd.doc">http://www.cen.uiuc.edu/~cburian/lcd.doc</A><BR>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<A href="http://www.teleport.com/~raybutts/lcd-faq.htm">http://www.teleport.com/~raybutts/lcd-faq.htm</A><BR>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<A href="http://www.ee.ualberta.ca/~charro/cookbook/faq/">http://www.ee.ualberta.ca/~charro/cookbook/faq/</A><BR>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<A href="http://www.synapsis.it/UW/stefanon/files/LCD.txt">http://www.synapsis.it/UW/stefanon/files/LCD.txt</A><BR>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<A href="http://www.rohm.co.jp/products/databook/lcd/pdf/index.html">http://www.rohm.co.jp/products/databook/lcd/pdf/index.html</A><BR>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<A href="http://www.iaehv.nl/users/pouweha/lcd0.htm">http://www.iaehv.nl/users/pouweha/lcd0.htm</A><BR>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<A href="http://www.doc.ic.ac.uk/~ih/doc/lcd/">http://www.doc.ic.ac.uk/~ih/doc/lcd/</A><BR>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<A href="http://www.seetron.com/">http://www.seetron.com/</A>
<tt>

<P><tt>A karakteres LCD kijelz&#337;k nagy száma a <B>Hitachi HD 44760</B>-as cél mikrovezérl&#337;n (vagy ezzel egyenérték&#369; klónokon) alapszanak.</tt></P>

<IMG SRC="../../pics/LCD/lcd_character.jpg" WIDTH=260 HEIGHT=260 ALT="" BORDER="0" ALIGN="left">
<P ALIGN="justify"><tt>A karakteres kezelés lényege, hogy az LCD kijelz&#337; felületén elkülönített négyszögeket képeznek ki 5x7 esetleg 5x9 képelemb&#337;l, s egy karaktergenerátorral határozzák +, hogy milyen karakterek jeleníthetöek + egy-egy ilyen karakterpozíción. A felhasználónak csak azt kell kijelölnie valamilyen kódrendszer felhasználásával (az általánosan elfogadott itt is az ASCII kód alkalmazása), hogy melyik karakterpozicióra melyik el&#337;re definiált karakterrajz kerüljön ki.</tt></P>
<P ALIGN="justify"><tt>&Aacute;ltal&aacute;ban elhelyeznek m&eacute;g egy plusz sort is a kurzornak. Az LCD egy sorában különböz&#337; darabszámú karakterhely lehet, s a sorok száma is változó.</tt></P>

<BR CLEAR="all">

<P>&nbsp;</P>
<P><tt>Csatlakoz&oacute; kioszt&aacute;s:</tt></P>

<P>
<IMG SRC="../../pics/LCD/lcd_front.jpg" WIDTH=510 HEIGHT=265 ALT="" BORDER="0">
<IMG SRC="../../pics/LCD/lcd_side1.jpg" WIDTH=100 HEIGHT=235 ALT="" BORDER="0">
<IMG SRC="../../pics/LCD/lcd_side2.jpg" WIDTH=100 HEIGHT=230 ALT="" BORDER="0">
</P>

<P>Pin#   Jel&ouml;l&eacute;s&#9;Szint  &#9;Funkci&oacute;&#9;&#9;Function</P>
<P>----------------------------------------------------------------------------------------------------------------------------</P>
<P> 1&#9;    &#9;Vss&#9;0V&#9;&#9;test&#9;&#9;&#9;Ground</P>
<P> 2&#9;    &#9;Vcc&#9;+5V&#9;&#9;t&aacute;p fesz.&#9;&#9;Module power supply</P>
<P> 3&#9;    &#9;Vee&#9;megj.(1)&#9;kontraszt&#9;&#9;Liquid crystal driving voltage</P>
<P> 4&#9;    &#9;RS_&#9;H/L&#9;&#9;&#9;&#9;&#9;Register select, H=data input, L=instruction code input</P>
<P> 5&#9;&#9;R/W&#9;H/L&#9;&#9;&#9;&#9;&#9;Read/Write, H=data read from LCD -&gt; to CPU, L=data write from CPU -&gt; to &#9;&#9;&#9;&#9;&#9;&#9;&#9;&#9;LCD</P>
<P> 6      &#9;E&#9;megj.(2)&#9;engedélyez&#337; jel&#9;Edge-sensitive Enable </P>
<P> 7     &#9;DB0&#9;megj.(3)&#9;adat 0&#9;&#9;&#9;Data bus line 0  (least significant bit)</P>
<P> 8     &#9;DB1&#9;"&#9;&#9;adat 1&#9;&#9;&#9;Data bus line 1</P>
<P> 9     &#9;DB2&#9;"&#9;&#9;adat 2&#9;&#9;&#9;Data bus line 2</P>
<P>10     &#9;DB3&#9;"&#9;&#9;adat 3&#9;&#9;&#9;Data bus line 3</P>
<P>11     &#9;DB4&#9;"&#9;&#9;adat 4&#9;&#9;&#9;Data bus line 4</P>
<P>12     &#9;DB5&#9;"&#9;&#9;adat 5&#9;&#9;&#9;Data bus line 5</P>
<P>13     &#9;DB6&#9;"&#9;&#9;adat 6&#9;&#9;&#9;Data bus line 6</P>
<P>14     &#9;DB7&#9;"&#9;&#9;adat 7&#9;&#9;&#9;Data bus line 7</P>

<P><tt>Azokon az LCD kijelz&#337;kön ahol van hattérvilágítás is ott még több kivezetés is lehet. Ezekr&#337;l a kijelz&#337; adatlapjában találhatunk leírást.</tt></P>

<P>megj.(1) -&gt; P&eacute;lda a kontraszt bek&ouml;t&eacute;shez:</P>

<P>+5V ------------*----------- Vcc</P>
<P>                |</P>
<P>                /</P>
<P>        10k to  \&lt;---------- Vee</P>
<P>        20k pot /</P>
<P>                \</P>
<P>                |</P>
<P>GND ------------*----------- Vss</P>

<P><tt>Tesztel&eacute;sre j&oacute; +old&aacute;s lehet az, ha a Vee-t r&aacute;k&ouml;tj&uuml;k a Vss(GND)-re, de vigy&aacute;zzunk arra, hogy &iacute;gy az LCD l&aacute;that&oacute;s&aacute;gi sz&ouml;ge megv&aacute;ltozik. Mozgassuk a kijelz&#337;t addig míg megfelel&#337;en nem tudjuk olvasni...</tt></P>

<P><tt>A HD 44780 nyolcbites adatokkal illetve utas&iacute;t&aacute;sokkal muk&ouml;dik, de megoldhat&oacute; a n&eacute;gybites kezel&eacute;se is. A kijelz&eacute;sre v&aacute;r&oacute; inform&aacute;ci&oacute;t a Display Data RAM, DDRAM t&aacute;rolja - ennek 80 k&oacute;dnyi kapacit&aacute;sa az &aacute;ramk&ouml; &aacute;ltal kezelheto karaktermennyis&eacute;g felso hat&aacute;ra. A DDRAM tartalma alapj&aacute;n m&aacute;r a vez&eacute;rlo v&eacute;gzi el a karakterk&eacute;ppl val&oacute; &aacute;ttramnszform&aacute;l&aacute;st s a kijelzo megfelelo k&eacute;pelemeinek idomultiplexelt muk&ouml;d&eacute;s&eacute;t. A karaktereket 5x7 vagy 5x9 ponton tudja megjelen&iacute;teni.</tt></P>
<P><tt>A karakterk&oacute;dok alapj&aacute;n a kijelz&eacute;si k&eacute;p bitsorait a Character Generator ROM, CGROM adja meg, melyben 160 r&ouml;gz&iacute;tett rajzolat&uacute; karakter k&eacute;pe t&aacute;rol&oacute;dik. Egy tov&aacute;bbi belso mem&oacute;riater&uuml;let a Character Generator RAM, CGRAM arra ad lehetos&eacute;get, hogy a felhaszn&aacute;l&oacute; maga alak&iacute;tson ki tetszoleges mint&aacute;zat&uacute; karaktereket - egyidoben legfeljebb nyolc k&uuml;l&ouml;nf&eacute;le, 5x7 m&eacute;retu specialis karaktert. A belso RAM-ok k&ouml;zvetlen&uuml;l el&eacute;rhetok, &iacute;rhat&oacute;/olvashat&oacute; mem&oacute;ri&aacute;k, a kijelz&eacute;sre fel nem haszn&aacute;lt r&eacute;zletek - pl. a CGRAM-ban ki nem haszn&aacute;lt bitek - mindig felhaszn&aacute;lhat&oacute;ak tetszoleges c&eacute;l&uacute; inform&aacute;ci&oacute; t&aacute;rol&aacute;s&aacute;ra is.</tt></P>
<P><tt>A HD 44780-nal szerelt LCD modulok ak&aacute;r 8 bites, ak&aacute;r 4 bites k&ouml;zponti egys&eacute;gu eszk&ouml;zzel k&eacute;pesek egy&uuml;ttmuk&ouml;dni - az utas&iacute;t&aacute;sok &eacute;s adatok 8 bites szavank&eacute;nt vagy 4 bites szeletenk&eacute;nt is mozgathat&oacute;k a master elem &eacute;s a modul k&ouml;z&ouml;tt. A 80 b&aacute;jtos DDRAM &eacute;s a 64 b&aacute;jtos CGRAM a programozottan 4 vagy 8 bites adatbuszon &aacute;t kezelheto, t&ouml;ltheto fel illetve olvashat&oacute; vissza. A modulbe&eacute;p&iacute;tet osztill&aacute;torral muk&ouml;dik - minden idoz&iacute;t&eacute;snek ez az alapja. A t&aacute;pfesz&uuml;ltse&eacute;g bekapcsol&aacute;sakor a vez&eacute;rlo egy automatikus RESTE folyamatot is lefuttat &eacute;s automatikusan ind&iacute;tja a  belso oszcill&aacute;tort is.</tt></P>
<P><tt>Ha egy modul 4 bites &uuml;zemre &uuml;zemre &aacute;ll&iacute;tunk be, a 8 bites adatbusz als&oacute; vezet&eacute;kei feleslegezz&eacute; v&aacute;lnak, az inform&aacute;ci&oacute;mozgat&aacute;sok a felso adtvezet&eacute;ken (D4…D7) val&oacute;sulnak meg.</tt></P>
<P><tt>Ilyenkor az eredeti nyolcbites inform&aacute;ci&oacute; felso 4 bitje l&eacute;p &aacute;t elosz&ouml;r, majd azut&aacute;n az als&oacute; n&eacute;gy bit. A k&eacute;sobb ismertet&eacute;sre ker&uuml;lo Busy Flag a teljes inform&aacute;ci&oacute; egys&eacute;g &aacute;tv&eacute;tel&eacute;t jelzi - n&eacute;gybites muk&ouml;d&eacute;sn&eacute;l &iacute;gy a m&aacute;sodik szelet &aacute;tvitel&eacute;t k&ouml;vetoen fog csak szabad &aacute;llapotot jelezni! Nyolcbites illezt&eacute;s alkalmaz&aacute;sakor egy-egy nyolcbites inform&aacute;ci&oacute; term&eacute;szetesen egyetlen l&eacute;p&eacute;sben &aacute;tviheto a master egys&eacute;g &eacute;s a modul k&ouml;z&ouml;tt.</tt></P>
<P><tt>A HD44780-ban k&eacute;t regisztert alak&iacute;tottak ki:</tt></P>
<P><tt>- Instuction Register, IC</tt></P>
<P><tt>- Data Register, DC</tt></P>
<P><tt>Az IR t&aacute;rolja az utas&iacute;t&aacute;sk&oacute;dot &eacute;s a c&iacute;minform&aacute;ci&oacute;t (a DDRAM illetve a CGRAM c&iacute;meket). Az IR csak &iacute;rhat&oacute; regiszter. A DR egy &aacute;ltal&aacute;nos c&eacute;l&uacute; adatt&aacute;rol&oacute; regiszter. A master egys&eacute;gbol &eacute;rkezo b&aacute;jt elosz&ouml;r ide ker&uuml;l, majd innen helyezodik &aacute;t az utas&iacute;t&aacute;soknakl megfeleloen pl. a DDRAM-ba vagy a CGRAM-ba. A DR-t a DDRAM illetve a CGRAM olvas&aacute;sakor is haszn&aacute;lja az IC. H az IR-nem RAM c&iacute;m &aacute;ll, a megfelelo RAM rekesz tartalma be&iacute;r&oacute;dik a DR-be. Az adatkivitel, a kiolvas&aacute;s akkor z&aacute;rul le, ha a master egys&eacute;g kiolvassa a DR tartalm&aacute;t- A HD 44780 egy belso mechanizmussal meg tudja oldani, hogy egy RAM muvelet ut&aacute;n automatikusan v&aacute;ltoztassa eggyel a c&iacute;m&eacute;rt&eacute;ket - &iacute;gy a sorozato be&iacute;rasok illetve kiolvas&aacute;sok jelentosen gyors&iacute;that&oacute;k.</tt></P>
<P><tt>Az Address Counter, AC (c&iacute;msz&aacute;ml&aacute;l&oacute;) egys&eacute;g &aacute;ll&iacute;tja elo a DDRAM &eacute;s a CGRAM sz&aacute;m&aacute;ra is a c&iacute;m&eacute;rt&eacute;keket. Amikor a c&iacute;mbe&aacute;ll&iacute;t&oacute; utas&iacute;t&aacute;s (Address Set) ker&uuml;l az IR-be, a c&iacute;inform&aacute;ci&oacute; &aacute;tker&uuml;l a c&iacute;msz&aacute;ml&aacute;l&oacute;ba. A c&iacute;mbe&aacute;ll&iacute;t&oacute; tas&iacute;t&aacute;s azt is meghatrozza, hogy ez a c&iacute;m melyik RAM-ra vonatkozik. A c&iacute;msz&aacute;ml&aacute;l&oacute; &aacute;ll&aacute;sa a modulb&oacute;l kiolvashat&oacute; , RS=0 ls R/W=1 vez&eacute;lokjelek mellett.</tt></P>

<P><table BORDER=0 CELLSPACING=0 CELLPADDING=0 WIDTH="100%">
<tr>
<td ALIGN=middle VALIGN=center BGCOLOR="#000000"><font face="Arial, Helvetica, Verdana, Lucida"><font color="#ffffff"><font size=-2>©
FLEISCHMANN György -&nbsp;</font></font></font><A href="mailto:gfleischmann@yahoo.com"><IMG align=absMiddle border=0 height=10 src="../../pics/html/mailto.gif" width=14></A></td>
</tr>
</table></P>

</BODY>

</HTML>