<html>
<head>
	<title>Az én könyvem - Macho Grande</title>
</head>

<body topmargin="0" bottommargin="0" leftmargin="0" rightmargin="0" bgcolor="#FFFFEE" alink="Green" link="Red" vlink="Black">

<table width="100%" border="0">
<tr>
  <td>
  <table width="100%" border="0" cellpadding="0" cellspacing="0">
    <tr>
	  <td colspan="3">
	  <!-- Fejléc -->
	  <table width="100%" height="70" border="0" cellpadding="0" cellspacing="0">
	  <tr>
	    <!-- width="12%" -->
        <td align="left" valign="top">
		<a href="http://www.geocities.com/gfleischmann/index.html"><img src="../../pics/mybook/home.gif" width="16" height="16" alt="Home" border="0"></a>
        <img src="../../pics/mybook/floppy.gif" width="16" height="16" alt="Download" border="0">
		<img src="../../pics/mybook/printer_.gif" width="16" height="16" alt="Print" border="0"><br>		
		<a href="bevezetes.htm"><img src="../../pics/mybook/previous.gif" width="16" height="16" alt="-" border="0"></a>
		<img src="../../pics/mybook/search_.gif" width="16" height="16" alt="Search" border="0">
	    <a href="tartalom.htm"><img src="../../pics/mybook/tableofcontents.gif" width="16" height="16" alt="Tartalomjegyz&eacute;k" border="0"></a>
	    <img src="../../pics/mybook/next_.gif" width="16" height="16" alt="+" border="0">
		</td>
		<td>&nbsp;</td>
	    <td width="8%">&nbsp;</td>
	  </tr>
	  </table>
	  </td>
    </tr>
    <tr>
      <td width="12%">&nbsp;</td>
	  <td>
	    <!-- Fejezetcím -->
	    <table width="100%" height="70" border="0">
		<tr>
		  <td align="center" valign="top"><br><br><br><font face="Arial" size="5">Macho Grande</font><br></td>
		</tr>
		</table>
		<!-- Szöveg -->
		 <table border="0" align="left" cellpadding="0" cellspacing="0"><tr><td align="left" valign="top" ><br><font face="Arial" size="7">M</font>&nbsp;</td></tr></table> 
		 <p align="justify">ocskos egy &eacute;jjel volt. A gennyes Hold fenn d&ouml;gl&ouml;tt a s&ouml;t&eacute;t &eacute;gen. Az utca &uuml;res volt, mint a kurv&aacute;k sz&iacute;ve.<br>
		 De hirtelen iszonytat&oacute; zaj r&aacute;zta meg a L&aacute;gym&aacute;nyos Avenue h&aacute;zainak ablakait. Csak nem a Retkes F&eacute;rgek vad hord&aacute;ja k&ouml;zel&iacute;t? Nem. &Otilde; volt az. Egyed&uuml;l. A Kem&eacute;ny Cs&aacute;v&oacute;. Egy d&ouml;g&ouml;s chopperen &uuml;lt. A h&aacute;ts&oacute; ker&eacute;k egy 335/45 zr 60-as Pirelli volt. Az els&otilde; pedig egy NDK-s babakocsi t&ouml;m&ouml;rgumi apr&oacute;kereke. Meg&aacute;llt az iv&oacute; el&otilde;tt, le&aacute;ll&iacute;totta a 20 Zetor hangerej&eacute;vel versenyre kel&otilde; parip&aacute;j&aacute;t. Hanyag mozdulattal lesz&aacute;llt a g&eacute;pr&otilde;l, &eacute;s egy pillanatra meg&aacute;llt. Most b&aacute;rki j&oacute;l szem&uuml;gyre vehette. Hideg tekintetet, kem&eacute;ny von&aacute;sokat, zs&iacute;r-zsel&eacute;s copfot, nagy bicepszeket, bika termetet viselt az a boz&oacute;tarc&uacute; vad&aacute;llat. Ezek j&oacute;l kieg&eacute;sz&iacute;tett&eacute;k r&eacute;zszegecsekkel d&iacute;sz&iacute;tett b&otilde;rdzsekij&eacute;t, kopott farmer&eacute;t &eacute;s n&eacute;gerborda d&ouml;nget&otilde; orm&oacute;tlan motoroscsizm&aacute;j&aacute;t.<br>
		 Ekkor m&eacute;rhetetlen lazas&aacute;ggal cigarett&aacute;t sodort mag&aacute;nak, &eacute;s meggyujtotta a gyuf&aacute;t smirgliszer&ucirc; borost&aacute;j&aacute;n, majd a m&eacute;g par&aacute;zsl&oacute; sz&aacute;lat r&aacute;p&ouml;ck&ouml;lte  egy &eacute;pp arra halad&oacute; British Petrol kamionra. A cs&oacute;t&aacute;ny &uuml;r&uuml;l&eacute;kkel nemes&iacute;tett doh&aacute;ny fanyar illata bet&ouml;lt&ouml;tte a k&ouml;rny&eacute;ket.<br>
		 Ber&uacute;gta az iv&oacute; ajtaj&aacute;t. A pinc&eacute;r m&aacute;ris ugrott &eacute;s &ouml;sszes&ouml;p&ouml;rte a f&ucirc;r&eacute;szport. A csod&aacute;lkoz&oacute; k&eacute;p&ucirc; pinc&eacute;rt szemenk&ouml;pte, &eacute;s elindult a b&aacute;rpult fel&eacute;. Ledobta mag&aacute;t az &uuml;l&otilde;k&eacute;re &eacute;s m&eacute;ly, szadistoid, fojtott, kem&eacute;ny hangj&aacute;n megsz&oacute;lalat:<br>
		 <br>
		 &nbsp;&nbsp;&nbsp;&nbsp;- Hozzad!<br>
		 <br>
		 A mixer m&aacute;r rohant is, &eacute;s kisv&aacute;rtatva el&eacute;tette a l&aacute;ngol&oacute; italt. Kerit&eacute;sszaggat&oacute;, emberpr&oacute;b&aacute;l&oacute;, bikabasz&oacute;, er&otilde;s lucernap&aacute;linka volt. Egy h&ouml;rpint&eacute;sre kiitta. Remeg&otilde; k&eacute;zzel t&ouml;lt&ouml;ttek &uacute;jra neki.<br>
		 <br>
		 &nbsp;&nbsp;&nbsp;&nbsp;- Sz&oacute;val r&aacute;l&eacute;pt&eacute;l a kedvenc kavicsomra?! -  mondta egy mellette &aacute;ll&oacute; alaknak, de m&aacute;r nyomban a tettek mezej&eacute;re is l&eacute;pett, az ipse let&eacute;pett &aacute;lkapcs&aacute;t a pult m&ouml;g&eacute; dobta, az meg nem tudott lehajolni elgurult szemgoly&oacute;j&aacute;&eacute;rt a kett&eacute;t&ouml;rt gerinc&eacute;vel. A Kem&eacute;ny nem szarozott tov&aacute;bb; a kiboml&oacute; beleivel megfojtotta a szerencs&eacute;tlent.<br>
		 <br>
		 &nbsp;&nbsp;&nbsp;&nbsp;- N&otilde; k&eacute;ne! - f&ucirc;zte tov&aacute;bb gy&eacute;r gondolatait a Nagymen&otilde;.<br>
		 <br>
		 Egy szakadt rihe telepedett mell&eacute;je. &Otilde; csak annyit mondott, hogy k&iacute;v&aacute;nlak; s m&aacute;ris v&eacute;resre harapta a g&aacute;r&eacute; ajkait. Egy heveny bels&otilde; v&eacute;rz&eacute;seket okoz&otilde; tapiz&aacute;s ut&aacute;n let&eacute;pte a csajszi ruh&aacute;it. Feldobta a leveg&otilde;be a n&otilde;t, s m&iacute;g az f&ouml;ldet &eacute;rt tucatszor mag&aacute;&eacute;v&aacute; tette. V&eacute;g&uuml;l levezet&eacute;sk&eacute;nt j&oacute;l beler&uacute;gott a r&aacute;ngat&oacute;z&oacute; vaginamumusba. A csaj b&otilde;rizomt&ouml;ml&otilde;in v&aacute;nszoorgva kics&uacute;szk&aacute;lt a k&eacute;pb&otilde;l. A Mok&aacute;ny megingatta a fej&eacute;t.<br>
		 <br>
		 &nbsp;&nbsp;&nbsp;&nbsp;- M&aacute;r megint egy kurva unalmas este! - mormogta mag&aacute;ban, &eacute;s elindult a kij&aacute;rat fel&eacute;. Kivette a sz&aacute;ja sark&aacute;ban fityeg&otilde; cigarettacsikket, &eacute;s elnyomta egy &eacute;pp arra j&aacute;r&oacute; puf&oacute;k napk&ouml;zis homlok&aacute;n.<br>
		 Ezut&aacute;n n&eacute;m&aacute;n felsz&aacute;llt motorj&aacute;ra, kegyetlen&uuml;l felb&otilde;gette, &eacute;s elporzott vele a t&aacute;volba. A s&ouml;t&eacute;ts&eacute;g hamar befogatta pontt&aacute; zsugorod&oacute; sziluettj&eacute;t. Ism&eacute;t csend ereszkedett a kihalt utc&aacute;ra.<br>
		 <br>
		 Unger Zsolt.
	  </td>
	  <!-- Lapszám -->
	  <td width="8%" align="right" valign="middle">
	  <table bgcolor="Black" cellpadding="0" cellspacing="0" align="center" border="0">
	  <tr>
	    <td colspan="3" height="1"><img src="../../pics/html/1x1.gif" width="1" height="1" alt="" border="0"></td>
	  </tr>
	  <tr>
	    <td width="1"><img src="../../pics/html/1x1.gif" width="1" height="1" alt="" border="0"></td>
	    <td bgcolor="#FFFFEE" align="center">&nbsp;?&nbsp;</td>
	    <td width="1"><img src="../../pics/html/1x1.gif" width="1" height="1" alt="" border="0"></td>
	  </tr>
	  <tr>
	    <td colspan="3" height="1"><img src="../../pics/html/1x1.gif" width="1" height="1" alt="" border="0"></td>
	  </tr>	  
	  </table>
	  </td>
    </tr>
    <tr>
	  <td colspan="3">
	  <!-- Lábléc -->
	  <table width="100%" height="70" border="0" cellpadding="0" cellspacing="0">
	  <tr>
        <td width="12%">&nbsp;</td>
	    <td>&nbsp;</td>
	    <td width="8%">&nbsp;</td>
	  </tr>
	  </table>
	  </td>
    </tr>
  </table>	
  </td>
  <td width="2%">
  &nbsp;
  </td>
</tr>
</table>

</body>
</html>

