<HTML>

<HEAD>
  <TITLE>Gyurci/Flex's Main Page</TITLE>
</HEAD>

<BODY BGCOLOR="#ffffff">

http://www.void.demon.nl/spectrum.html

<hr SIZE=1 NOSHADE WIDTH="80%" align="center">

<center>
<table ALIGN=CENTER BORDER=0 WIDTH="100%">
<tr>
<td colspan="2"><p align="justify">"Ez afféle üzenet itt. Nincs miért tagadni, hatékonysága kb. tengerbe hajított palackéval azonos, de helyes ez így. Az üzenet, tartalmát tekintve, meglehetősen ködös, inkább csak valami kis izé. Arról akar szólni, hogy "vigyázz, ne dőlj be minden hülyeségnek". De ez így túlontúl sommás és mindenféle árnyalat nélkül való.<BR>
<BR>
Arról akar szólni tehát ez az üzenet, hogy ne essünk ugyanabba a hibába az internet kapcsán, amiben egyszer már a TV kapcsán beleestünk. Egy pillanatig se higgyük el, hogy ez önmagában jó. Szintúgy ne higgyük el, hogy bármilyen értelemben megváltja vagy csak megjavítja a társadalmat.<BR>
<BR>
Fenét.<BR>
<BR>
Az interneten már most zajlik az a folyamat, amelynek eredménye egy hatalmas, interaktív fogyasztói izé lesz, mondjuk Metaverzum, és csak annyiban lesz interaktív, amennyire a fogyasztásra való serkentés megkívánja. A TV-vel ellentétben az internet sokféle rászokási lehetőséget kínál: aki nem szokott rá a www-re, azt talán az irc-re lehet ránevelni és így tovább. Ez a sokféle függési lehetőség hamis magabiztosságba ringathatja a felhasználót, aki azt hiheti, végre ő az, aki válogat. Hehe. A TV-vel ellentétben az internetes etetőgép azonnal reagálhat, ha unod őt; olyan lesz, mint egy rossz ágyas, mindent megpróbál majd, hogy csak vele foglalkozz.<BR>
<BR>
Ez egyébként rendben is van így.<BR>
<BR>
Az üzenet, amiről most beszélünk, arról is szól még, hogy vége van a hőskornak, és tulajdonképpen jó is, hogy így van. Az eszünket kellene használni most talán jobban, mint a TV-zés hajnalán, szóval ne kábuljunk el annyira. Valójában minden jól van az internettel kapcsolatban, ekkora valami és önálló életet él... szóval kívül esik a jó vagy a rossz megítélésén, és ez az, amiért minden rendben jól van vele kapcsolatban. Működik és kész. Ebben az a jó, hogy valójában nálunk van a billentyűzet meg az egér. Az üzenet arról szól, hogy ezt nem kéne elfelejteni.<BR>
<BR>
Végre eszembe jutott." (CCFZ: Palack a tengerben) <A HREF="http://www.ccfz.hu/kiki.html"><IMG ALIGN="absmiddle" SRC="../pics/html/arrow_g.gif" WIDTH=15 HEIGHT=15 ALT="" BORDER="0" hspace="0"></A>
</td>
</tr>
</table>
</center>

<p><tt><b>IRODALOM</b><br>
Ha csak visszatekintek a hi&aacute;nyos irodalmi m&ucirc;velts&eacute;gemre, amit a gimn&aacute;ziumban szereztem, ahol olyanokat tanultuk, hogy a k&ouml;lt&otilde; a kozmikus m&eacute;ret&ucirc; mag&aacute;ny&aacute;t hogyan fejezi ki m&ucirc;veiben, akkor egy kicsit elborzadok ett&otilde;l a vil&aacute;gt&oacute;l...</tt>

<p><tt><b>?</b><br>
Simon Stevin: Semmi sem olyan csod&aacute;latos, mint amilyennek l&aacute;tszik.</tt>

<p><tt><b>VIL&Aacute;GUNK</b><br>
A h&eacute;tk&ouml;znapi emberek, akik t&uacute;ls&aacute;gosan tudatlanok ahhoz, hogy saj&aacute;t kez&uuml;kbe vegy&eacute;k a felel&otilde;ss&eacute;get saj&aacute;t boldogul&aacute;suk&eacute;rt.
A m&ucirc;veletlen v&aacute;rosi t&ouml;megek egyetlen passzi&oacute;ja, &eacute;s bev&eacute;tel&uuml;k java a bev&aacute;s&aacute;rl&oacute; k&ouml;zpontokban megy el.
<br>
Mad&aacute;ch nem fejezhette be az Ember trag&eacute;di&aacute;j&aacute;t azzal, hogy
az emberis&eacute;g kihalt. Ez egy kicsit zavaross&aacute; tette volna az eg&eacute;sz m&ucirc;vet. Csak annyit tehet&uuml;nk, hogy beismerj&uuml;k a veres&eacute;g&ucirc;nket, hogy nincs cselekv&eacute;si szabads&aacute;ga, minden az &ugrave;r rendel&eacute;se szerint t&ouml;rt&eacute;nik, m&aacute;sk&eacute;pp nem is t&ouml;rt&eacute;nhet.
Most &uacute;gy n&eacute;z ki, hogy a mai vil&aacute;got p&aacute;r igen gazdag ember ir&aacute;ny&iacute;tja...
Nem &eacute;rtem, mert nem is &eacute;rthetem, hogy az &uacute;ton v&eacute;gig kell menni, nincs m&aacute;s v&aacute;laszt&aacute;sunk. Az egyetlen kib&uacute;v&oacute; az &ouml;ngyilkoss&aacute;g. Az egyetlen szabad emberi cselekedet, az egyed&uuml;li m&oacute;dja a vil&aacute;grenddel val&oacute; szembehelyezked&eacute;snek, tal&aacute;n ez&eacute;rt is &uuml;ld&ouml;zte ennek gondolat&aacute;t az egyh&aacute;z.</tt>

<p><tt><b>CSILLAGOK</b><br>
Mi&eacute;rt is j&oacute; a csillagos eget b&aacute;mulni? , mert a szem&uuml;nk receh&aacute;rty&aacute;j&aacute;ra es&otilde; f&eacute;ny olyan f&eacute;ny, ami 900.000 &eacute;v &oacute;ta j&ouml;n szakadatlanul a vegtelenb&otilde;l, hogy a mi szem&uuml;nkbe jusson.
Ezek a f&eacute;yhull&aacute;mok 900.000 esztend&otilde;vel ezel&otilde;tt keltek &eacute;letre a t&aacute;voli k&ouml;d atomjaib&oacute;l s az&oacute;ta h&aacute;bor&iacute;tatlanul j&oacute;ttek &aacute;t a t&eacute;rem s amikor a szem&uuml;nkbe jutnak, el&otilde;szor &eacute;rnek szil&aacute;rd testet, elindul&aacute;suk &oacute;ta.</tt>

<p><tt><b>VALL&Aacute;S</b><br>
Hittel k&ouml;nnyebb, mint hit n&eacute;lk&uuml;l. Mindig irigyeltem azokat, akik csillog&oacute; szemmel, t&aacute;nor&iacute;thatatlanul menetelnek ak&aacute;r az &uuml;dv&ouml;z&uuml;l&eacute;s, ak&aacute;r a f&ouml;ldi paradisom fel&eacute;.
B&aacute;r olyan cip&otilde;ben j&aacute;rni egy &eacute;leten &aacute;t, melybe homok sz&oacute;r&oacute;dott, s ez most m&aacute;r soha el nem t&aacute;vol&iacute;that&oacute;, ha nem trag&eacute;dia is, de t&ouml;bb, mint alkalmi kellemetlens&eacute;g.</tt>

<p><tt><b>BAR&Aacute;TOK</b><br>
Nagyon j&oacute; dolog az amikor &ouml;sszej&ouml;v&uuml;nk azokkal az emberekkel, akikkel megoszthatjuk &eacute;let&uuml;nk sorsford&iacute;t&oacute; &eacute;lm&eacute;nyeit ... hiszen minden tal&aacute;lkoz&aacute;s &uacute;jabb apr&oacute;, de a r&eacute;sztvev&otilde;k sz&aacute;m&aacute;ra p&oacute;tolhatatlanul fontos r&eacute;szletekkel gazdag&iacute;tja az eml&eacute;kez&eacute;st&aacute;rh&aacute;z&aacute;t, hogy ez&aacute;ltal marad&eacute;ktalanul tiszt&aacute;zzak &eacute;s megemessz&eacute;k az el nem m&uacute;l&oacute; m&uacute;ltat.</tt>

Legy&uuml;nk optimist&aacute;k, hiszen alig van r&aacute; okunk.

Az itt olvashat&oacute; sz&ouml;vegek azoknak az embereknek sz&oacute;lnak, akik vagy tudatosan vagy v&eacute;letlen&uuml;l ker&uuml;ltek ide... </tt>

<p><tt><b>KOMP&Uacute;TEREK</b><br>
Az els&otilde; sz&aacute;m&iacute;t&oacute;g&eacute;p, amivel k&ouml;zeli kapcsolatba ker&uuml;ltem egy amerikai <a href="http://www.hh.schule.de/hhs/mjaap/zx81.htm"><img SRC="../pics/logos/sinclair_logo_inv.gif" ALIGN=ABSMIDDLE WIDTH="131" HEIGHT="18" BORDER=0></a> <a href="http://www.hh.schule.de/hhs/mjaap/zx81.htm">ZX81</a> volt.
M&eacute;g &iacute;gy visszatekintve is nagyon nagy hat&aacute;st gyakorolt r&aacute;m.</tt>

<p><tt><b>LOVE (XX.XX.XX.)</b><br>
"Love means never having to say you're sorry-"</tt>

<p><tt><b>HomePage (XX.XX.XX.)</b><br>
Nekem ez jut r&oacute;la eszembe: h&uuml;lye picsa.</tt>

<p><tt><b>K&ouml;NYVEK</b><br>
Nem szeretem azokat a k&ouml;nyveket, melyek nem tartalmaznak el&otilde;sz&oacute;t ez&eacute;rt  meg is ragadom a lehet&otilde;s&eacute;get &eacute;s a saj&aacute;t HomePage-emhez &iacute;rok is egyet. Itt persze olyan k&otilde;nyvekre gondolok amelyek valami mondanival&oacute;t tartalmaznak, nem egy sima krimire, ott ennek nincs semmi jelent&otilde;s&eacute;ge, de az&eacute;rt ott sem &aacute;rt tiszt&aacute;zni n&eacute;h&aacute;ny dolgot, ha m&aacute;st nem is, de lagal&aacute;bb a m&ucirc; megir&aacute;s&aacute;nak ok&aacute;t, &eacute;s a megjelen&eacute;s&eacute;nek k&ouml;r&uuml;lm&eacute;nyeit.
Ett&otilde;l f&uuml;ggetlen&uuml;l ezen &eacute;s az ezt k&ouml;vet&otilde;  lapokon nem kell nagy gondolatokat keresni, mert nem lesznek.
Az el&otilde;sz&oacute;val minden esetleges f&eacute;lre&eacute;rt&eacute;s elker&uuml;lhet&otilde;. Maga az  &eacute;rz&eacute;s a gimn&aacute;zium &oacute;ta tart. Ott &eacute;bredtem r&aacute;, hogy egy kicsit s&aacute;nt&iacute;tanak a magyar&oacute;r&aacute;k &eacute;s az irodalomkritikusok magyar&aacute;zatai. Az a legjobb, ha az &iacute;r&oacute;/szerz&otilde; mondja meg  a v&eacute;lem&eacute;nyet a dolgr&oacute;l. &icirc;gy nincs lehet&otilde;s&eacute;g a mell&eacute;beszel&eacute;sre.</tt>

<p><tt><b>?</b><br>
Itt az id&otilde;, hogy &iacute;rk&aacute;ljunk valamit magunlkr&oacute;l vagy ak&aacute;rmir&otilde;l, de mir&otilde;l is... nem az els&otilde; alkalom, hogy azon gondolkodom, mit is lehetne &iacute;rni egy priv&aacute;t ember HomePage (hP)-&eacute;re, de m&eacute;g mindig nem siker&uuml;lt kital&aacute;lnom. Kezdhetn&eacute;m azzal, hogy milyen sz&eacute;p &eacute;s milyen okos vagyok..., de ez megsem el&eacute;g cool a mai vil&aacute;gban vagy, hogy milyen szep a vil&aacute;g, de ez pedig nem igaz.  Mint az k&ouml;ztudott a mai ember m&aacute;r nem &eacute;lhet hP n&eacute;lk&uuml;l, teh&aacute;t &eacute;n sem huzom sok&aacute;ig ez lesz az...</tt>

<p><tt><b>Eg&eacute;szs&eacute;g</b><br>
&Eacute;n probalok egeszs&eacute;gesen &eacute;lni, de mire megyek vele el&ouml;bb ut&oacute;bb &uacute;gy is alulmaradok az &ouml;reged&eacute;ssel szemben vagy kicsin&aacute;l a t&uuml;d&otilde;, a m&aacute;j, az agy vagy a prosztatar&aacute;k esetleg egy kis AIDS vagy hasonl&oacute;k. Es aegeszseges &eacute;letm&oacute;dr&oacute;l besz&eacute;l&uuml;nk ebben a vil&aacute;gban. R&ouml;h&otilde;gn&otilde;m kell.</tt>

<p><tt><b>MUNKA</b><br>
Felh&iacute;v az oper&aacute;tor a c&eacute;gt&otilde;l, hogy valami gond van... elmagyar&aacute;zom, megnyugszunk majd megkerdezem, hogy mi a mai d&aacute;tum? XXX. k&ouml;sz&ouml;n&ouml;m. Leteszem a kagyl&oacute;t &eacute;s visszafekszem.</tt>


Asterix
http://w3.swi.hu/asterix/

	
<hr SIZE=1 NOSHADE WIDTH="70%">

<br CLEAR=BOTH>

<FORM METHOD=GET ACTION="http://www.egroups.com/subscribe">
<INPUT TYPE=HIDDEN NAME="listname" VALUE="flex-gyurci-news">
<TABLE BGCOLOR=#000000 BORDER=0 CELLPADDING=1 CELLSPACING=0><TR><TD>
<TABLE WIDTH=350 BGCOLOR=#FFFFCC BORDER=0 CELLPADDING=3 CELLSPACING=0>
<TR>
<TD BGCOLOR=#000000 WIDTH=100% ALIGN=CENTER><FONT FACE="arial,helvetica" COLOR=#FFFFFF><B>Feliratkozás a listámra (Flex-Gyurci-News)</B></FONT></TD></TR><TR><TD></TD>
</TR>
<TR>
<TD><INPUT TYPE=TEXT NAME="emailaddr" VALUE="valaki@akármi.bármi" SIZE=21><INPUT TYPE=SUBMIT NAME="SubmitAction" VALUE="Hajrá Szab&oacute; n&eacute;ni!!!"></TD>
</TR>
<TR>
<TD><A HREF="http://www.egroups.com/list/flex-gyurci-news/">Böngészés az arhívban...</A></TD>
</TR>
</TABLE>
</TD>
</TR>
</TABLE>
</FORM>

<table width="182" border="0" cellspacing="0" cellpadding="0"> <form action="http://www.geocities.com/cgi-bin/search/isearch" method="POST"><INPUT TYPE="hidden" NAME="DOMAIN" VALUE="geocities.com"><INPUT TYPE=HIDDEN NAME="FIELDS" VALUE="url,title,abstract,size,date,score"> <tr><td colspan="4" valign="TOP"><img src="http://pic.geocities.com/images/searchbox/sb_1blue_t.gif" width=188 height=17 alt="Search" border=0 hspace=0 vspace=0></td></tr> <tr><td bgcolor="#CCCCFF"><img src="http://pic.geocities.com/images/searchbox/sb_1blue_l.gif" width=17 height=28 alt="Search" border=0 hspace=0 vspace=0></td><td valign="MIDDLE" bgcolor="#CCCCFF"><input type="Text" name="QUERY" value="" size="13" maxlength="20"></td><td valign="MIDDLE" bgcolor="#CCCCFF"><input type="Image" name="submit" src="http://pic.geocities.com/images/searchbox/sb_findit.gif" border="0"></td><td bgcolor="#CCCCFF" align="right"><img src="http://pic.geocities.com/images/searchbox/sb_1blue_r.gif" width=4 height=28 alt="Search" border=0 hspace=0 vspace=0></td></tr> <tr><td colspan="4" valign="BOTTOM"><img src="http://pic.geocities.com/images/searchbox/sb_1blue_b.gif" width=188 height=44 alt="Search" border=0 hspace=0 vspace=0 USEMAP="#searchmap"></td></tr> </form> </table>
<map name="searchmap">
<area shape="rect" coords="9,6,105,17" href="http://www.geocities.com/search/websearch.html">
<area shape="rect" coords="105,6,174,17" href="http://www.geocities.com/search/tips.html">
<area shape="rect" coords="9,19,105,31" href="http://www.geocities.com/search/adv_geo.html">
</map>

Time (October 11, 1999) "In the past when a vibrator was passed around at a party, everyone would become giggly.
Now people ask about sizes and how many speeds it has."

Thanks for stopping by. My personal web page is currently down and in the process of being redone from
scratch. Please try again at a later date!

H&aacute;t itt van nek&uuml;nk ez az Orwell, aki ITT &eacute;s EKKOR meg&iacute;rta nek&uuml;nk a sz&eacute;p j&ouml;v&otilde;nket. &Eacute;n csak egyet&eacute;rteni tudok vele.

<p><table BORDER=0 CELLSPACING=0 CELLPADDING=0 WIDTH="100%">
<tr>
<td ALIGN=CENTER VALIGN=CENTER BGCOLOR="#000000"><font face="Arial, Helvetica, Verdana, Lucida"><font color="#FFFFFF"><font size=-2>&copy;
FLEISCHMANN Gy&ouml;rgy -&nbsp;</font></font></font><a href="mailto:gfleischmann@yahoo.com"><img SRC="../pics/html/mailto.gif" BORDER=0 height=10 width=14 ALIGN="absmiddle"></a></td>
</tr>
</table>

</BODY>

</HTML>
