<HTML>

<HEAD>
  <TITLE>Gyurci/Flex's Main Page</TITLE>
</HEAD>

<BODY BGCOLOR="#ffffff">

<table ALIGN=LEFT BORDER=0 WIDTH="100%" COLS=3> 
<tr>
<td><a href="../index.html"><img src="../pics/html/myhome.jpg" WIDTH="22" HEIGHT="22" BORDER=0></a></td>
<td align=center></td>
<td align=right><b><FONT SIZE="+3">Sz&ouml;v<i>egek, ???, h&iacute;rek</i></FONT></b></tr>
</table>

<br clear="all">

<hr SIZE="3" NOSHADE>

<FONT SIZE="+3">A demokr&aacute;cia nem j&oacute;, viszont egyel&otilde;re nincs jobb… avagy az &eacute;let kegyetlen, a gyeng&eacute;k elhullanak...
It seems we lose the game before we even start to play...</FONT>

<p align=justify><tt><b>IT</b><br>
Európában a 2 milliónyi informatikusi állás mintegy 20 százaléka betöltetlen. Az informatikai menedzserek sok idõt és pénzt költenek arra, hogy a távozók helyére lehetõleg állandó, rosszabb e.etben ideiglenes munkatársat keressenek. Az új
alkalmazottak többe kerülnek, mint a régiek, a toborzás költségei nem alacsonyak. Az informatikai igazgatók gyakran hangoztatják, hogy nem tudják megtartani régi stábjukat, s úgy vélik, ez kizárólag pénz kérdése. Akiknek kezét vállalati politika vagy törvény köti meg a magasabb fizetés megadása szempontjából, úgy látják, hogy informatikai személyzetük leépülése megállíthatatlan. Az alkalmazottakat a GartnerGroup szerint azonban nem egyedül csak a pénz mozgatja. Noha a kompenzáció fontos tényezõ, a dolgozók többségének szemében csak az elvégzett munka árát jelenti, maradásra nem ösztönzi õket. A bölcs vezetõ ekkor elõveszi jobbik eszét, s a személyzet épülését szolgáló
stratégiát dolgoz ki.<BR>
A Gartner kutatásai szerint még az alacsony fluktuációjú váIlalatok is a személyzetre allokált költségvetés legalább 10 százalékát költik az
eltávozók pótlására. Az alábbi táblázat egy SO tagú informatikai szervezet évi minimális személyzetpótlási költségeit mutatja, évi 35 ezer eurós átlagkereset esetén.
A számítások a Ganner konzervatív becslésén alapulnak, az európai, országonként különbözõ bérköltségeket figyelembe véve. A kalkulációba mindazonáltal nem ették bele a személyzet természetes fogyásának eszmei ("puha") költségeit, s eltételezték, hogy lehetséges az azonos szintû pótlás. (Volt ugyanis olyan eset, hogy egy eltávozott dolgozó helyére két új munkatársat kellett felvenni, mivel nem találtak hasonló munkabírású embert.) A számításokba viszont bekerültek olyan "kemény" tételek, mint az álláshirdetés költsége, az eltávozott dolgozó képzésére fordított összeg elvesztése, az interjúk költségei, költöztetés, ideiglenes szállás, az orvosi vizsgálat költségei; mindezek az új alkalmazott elsõ évi fizetésének 50-75 százalékára is níghatnak.
Mint ahogy a fenti táblázatból kiderül, egy 10 százalékos fluktuációval számoló cég évente több mint 137 ezer eurót költ munkaerõtoborzásra. De ezt a pénzt az informatikai igazgató nyugodtan elkölthetné a fizetések emelésére, a munkakörülmények javítására is, amivel csökkenthetné a fluktuációt, végsõ
soron általános költségeket takarítva meg. Ezt felismerve, a GartnerGroup szerint az elkövetkezõ három évben fél százalékkal csökkenthetõ az eltávozási arány.<BR>
<BR>
Néhány példa arra, hogyan lehet házon belül tartani a pótlási költségeket:<BR>
· Követni kell azokat a piaci jövedelmeket, amelyek az adott földrajzi és szegmensbeli kömyezetre jellemzõek.<BR>
· Rugalmassá kell tenni a munkakörülményeket, azaz meg kell találni az egyensúlyt a munkahelyi és az otthoni élet között. A fizetést és a prémiumot teljesítményfüggõvé kell tenni; az alkalmazottat jutalmazni kell képességei fejlesztéséért.<BR>
Valakinek az is elég, ha számára kedvezõ nyugdíjazási rendszert dolgoznak ki. Mindez növeli a dolgozó hûségét.<BR>
· Elõ kell segíteni a csapatszellem kialakulását. Olyan programokba kell invesztálni, amelyek révén az informatikusi csapat külsõ munkákban tud részt venni, találkozik a helyi közösséggel.<BR>
· Nem szabad elfeledkezni a képzésrõl sem. Tervet kell készíteni, milyen szaktudásra lehet szükség az elkövetkezõ öt évben, valamint a továbbképzést a dolgozók egyéni fejlõdéséhez kell igazítani. Mindenfajta tanulás ösztönzendõ, még az is, amely nem kapcsolódik közvetlenül a munkához.
<B>Mártonffy Attila</B></tt>

<p align=justify><tt><b>EMIR KUSTURICA: <a href="http://www.komuna.com/film/cmbm/index.html">"WHITE CAT, BLACK CAT"</A> ("Macskajaj")</b><BR><BR>
</tt>

<p align=justify><tt><b>J&oacute;zsef Attila: Ne légy szeles...</b><BR><BR>
Ne légy szeles.<BR>
Bár a munkádon más keres -<BR>
<B>dolgozni csak pontosan, szépen,<BR>
ahogy a csillag megy az égen,<BR>
&uacute;gy érdemes</B>.<BR>
</tt>

<img SRC="http://www.extra.hu/flex/pics/photos/kedvencek/pilis_erdo_.jpg" WIDTH="180" HEIGHT="274" ALIGN=RIGHT HSPACE="10" VSPACE="10">

<p align=justify><tt><b>FILMFR&Aacute;SZ (99.10.13.)</b> <b></A>AMIKOR A MINDENNAPI SZORONGANI VAL&Oacute; K&Eacute;PPEL, SZ&Iacute;NNEL, HANGGAL, ZENEV&Eacute;L &Eacute;RKEZIK (N&Eacute;PSZABADS&Aacute;G magazin IX. &Eacute;VFOLYAM, 40. sz&aacute;m)</b><br>
<img SRC="../pics/html/redball.gif"  WIDTH="14" HEIGHT="14"> "Erõszakosak a filmek, a hírek, sõt idõnként a reklámok is. Ma már nálunk is igaznak tûnik az a becslés, amelyet Benjamin Spock amerikai gyerekgyógyász fogalmazott meg jó pár éwel ezelõtt saját országáról: egy gyerek, mire 18 éves lesz, átlag 18 ezer gyilkosságot néz végig filmen, televízióban.
Lehetetlen? Nos, nézzünk végig egynapi mûsort, számoljunk a rajzfilmek robbantóival, felnégyelõivel, fejbecsapkodóival is, meg a tucatfilmek erõs fiúival, szörnyeivel és pisztolyhõseivel. És adjuk hozzá a hírmûsorokat, hisz az élet valóban erõszakos, nincs korrekt híradás e nélkül. Az más kérdés, hogy a riporterek már ott is vért keresnek, ahol nincs, és dramatizálnak ott, ahol nem lenne muszáj.<br>
A felnõtt persze védekezhet, ha elege van a riogatásból, kikapcsolja a készüléket, és viszszaszokik esténként az olvasásra. De a gyerek? Ott, ahol a családban a tévé a villanypásztor, a gyerekek nem szûkölködnek izgalomban, félelemben, ijesztgetésben. Van, amelyik kicsi rettegni kezd vagy ideges lesz és undok, esetleg rémálmai támadnak, éjjel újra bepisil. Különösen a kisebb gyerekek riadnak meg a képi erõszaktól. A három-, négy-, ötévesek még nem tudnak különbséget tenni a valóság és a mese között, a filmet igaznak hiszik, a boszorkányt valósnak. Hatéves kortól már kezdik érteni - különösen, ha el is mondják nekik -, hogy amit a képernyõn látnak, attól nem kell rettegniük, az csak a fantázia mûve. (Vagy nem az.)<br>
Igen ám - kérdezik azok, akik nem tulajdonítanak nagy jelentõséget a televízió hatásának -, de a mesekönyvek történetei, így a népmesék is tele vannak erõszakkal, gonoszsággal. Akkor azoktól is meg kell kímélni a gyereket? A szakemberek szerint a két élmény más. A televízióval a legtöbb gyerek egyedül van, nem tud kérdezni, ha félni kezd, nem kap azonnali megnyugtatást a szülõktõl, ráadásul a színes mozgókép, hang és zene sokkal nagyobb érzelmi hatást vált ki, mint a könyv. A könyvbõl valaki felolvas a kicsiknek, meghitt együttlét az ilyen, amit még egy vasorrú bába sem tud elrontani. Vagy ha igen, akkor a mama vagy a papa segítségével gyorsan tündérré lehet változtatni. Ezenkívül a mesékben az erõszak, a gonoszság a katarzis része, a bûnt büntetés követi, a jóságot jutalom. Az erõszakos filmeknél és sok rajzfilm esetében is az erõszak csak az erõszakért van jelen, lehessen izgulni és félni, más funkciója nincs.<br>
A médiából áradó erõszaktól azonban nemcsak félni vagy szorongani lehet, hozzá is lehet szokni. A sok félelmetes jelenet után gyerek, felnõtt egyaránt érzéketlenebb lesz. Közönyös. S eljuthat oda, hogy elfogadja, ha valaki erõszakos, a konfliktusokat hang- vagy fizikai erõvel oldja meg. Sõt, megtanulja maga is használni az erejét és az agresszivitását. A rajzfilmekbõl és a tucatfilmekbõl ugyanis egy dolgot nem lehet megtanulni, azt, hogy az erõszak fájdalmat, kínt okoz, és esetleg lelkiismeretfurdalást annak, aki a bûnt elkövette."<br>
<b>V. V.</b>

<p align=justify><tt><img SRC="../pics/html/news.gif"  WIDTH="35" HEIGHT="30"><b> NEWS (99.08.XX.)</b><br>
<img SRC="../pics/html/firka.gif"  WIDTH="15" HEIGHT="11"> Aki még nem tudná annak most mondom/írom, hogy át lettem keresztelve. Ezért 
mostanában két néven is lehet velem találkozni:</tt> <img SRC="../pics/gyurciflex2.gif" ALIGN=ABSMIDDLE WIDTH="107" HEIGHT="15">.

<p align=justify><tt><b>AZ ÉLET I.</b><br>
"... és késõbb, amikor beszálltunk a kocsiba, befordult egy utcába, amirõl egészen biztosan tudtam, hogy zsákutca.<br>
- Hova megyünk? - kérdeztem.<br>
- Nem tudom - mondta. - Csak úgy megyünk.<br>
- De ez az út nem vezet sehova - mondtam neki.<br>
- Az nem számít.<br>
- Miért mi számít? - kérdeztem kis szünet után.<br>
- Csak hogy rajta vagyunk, haver - mondta."<br>
<i><FONT SIZE="-1">(Bret Easton Ellis: Nullánál is kevesebb; Fordította M. Nagy Miklós)</FONT></i></tt>

<p align=justify><tt><b>&Eacute;LET II.</b><br>
Mindig olyan emberekkel kell &ouml;sszej&aacute;rni, akikkel az ember nem sz&iacute;vesen tal&aacute;lkozik; mindig azokhoz kell kedvesnek lenni, akiket ut&aacute;l az ember...

<p align=justify><tt><b>A KERESKEDELMI TV-K</b><br>
<img SRC="../pics/html/firka.gif"  WIDTH="15" HEIGHT="11"> Ez egyik rohadt kereskedelmi TV m&aacute;r megint kor&aacute;bban kezdte a m&ucirc;sort. Mennyivel kor&aacute;bbra kellene a vide&oacute;t be&aacute;ll&iacute;tani, hogy siker&uuml;lj&ouml;n v&eacute;gre egy filmet ez elej&eacute;t&otilde;l a v&eacute;g&eacute;ig felvenni?<br>
<img SRC="../pics/html/firka.gif"  WIDTH="15" HEIGHT="11"> K&uuml;l&ouml;nben is bekaphatjak a sok rekl&aacute;m miatt...</tt>

<img SRC="../pics/kilometrico_boomer.gif" WIDTH="100" HEIGHT="100" ALIGN=RIGHT HSPACE="10" VSPACE="10">

<p align=justify><tt><b>A LEGJOBB R&Aacute;G&Oacute;GUMI</b><br>
<img SRC="../pics/html/red_arrow.gif"  WIDTH="10" HEIGHT="12" ALIGN="absmiddle"> Az &eacute;vsz&aacute;zad legjobb r&aacute;g&oacute;gumija</tt>

<p align=justify><tt><b>JÖV&Otilde;NK</b><br>
Olvasom az egyre alacsonyabb sz&iacute;nvonal&uacute; SZ&Aacute;M&Iacute;T&Aacute;STECHNIKA c&iacute;m&ucirc; hetilapot (1999/32):
"Egy &uacute;j angol t&ouml;rv&eacute;nyjavaslat szerint k&eacute;t&eacute;ves b&ouml;rt&ouml;nb&uuml;ntet&eacute;st kock&aacute;ztat az, aki nem adja &aacute;t a hat&oacute;s&aacute;goknak az &aacute;ltala haszn&aacute;lt titkos&iacute;t&oacute;kulcsokat. Az ipari &eacute;s kereskedelmi miniszt&eacute;rium fel&uuml;gyelete alatt k&eacute;sz&uuml;l&otilde; Electronic Communication Bill alapvet&otilde;en arr&oacute;l sz&oacute;l, amire a c&iacute;me is utal: az elektronikus kereskedelemr&otilde;l, &aacute;m van egy z&aacute;rad&eacute;ka, s ez nagy meg&uuml;tk&ouml;z&eacute;st keltett a szigetorsz&aacute;g online k&ouml;z&ouml;ss&eacute;g&eacute;ben. A z&aacute;rad&eacute;kban ugyanis az szerepel, hogy k&eacute;t &eacute;vig terjed&otilde; b&ouml;rt&ouml;nb&uuml;ntet&eacute;ssel s&uacute;jthat&oacute;, aki a hat&oacute;s&aacute;gok k&eacute;r&eacute;s&eacute;re nem adja &aacute;t titkos&iacute;t&oacute;kulcsait, illetve az &uuml;zenetek egyszer&ucirc; sz&ouml;veges v&aacute;ltozat&aacute;t. &Ouml;t&eacute;ves b&ouml;rt&ouml;n j&aacute;r annak, aki m&aacute;sokat figyelmeztet az ellen&uuml;k foly&oacute; vizsg&aacute;latra, az pedig m&aacute;r egyenesen Orwell v&iacute;zi&oacute;ira eml&eacute;keztet, hogy a vizsg&aacute;latok nyilv&aacute;noss&aacute;g el&otilde;tti kit&aacute;rgyal&aacute;sa - p&eacute;ld&aacute;ul ha valaki a m&eacute;di&aacute;ban panaszkodik - szint&eacute;n b&ouml;rt&ouml;nt vonhat maga ut&aacute;n.
Egy p&eacute;ld&aacute;val illusztr&aacute;lva: egy vizsg&aacute;lat al&aacute; vont szem&eacute;ly olyan titkos&iacute;tott &uuml;zenetet k&uuml;ld nekem, amit csak &eacute;n tudok dek&oacute;dolni. A hat&oacute;s&aacute;g k&eacute;pvisel&otilde;i kisz&aacute;llnak hozz&aacute;m lefolytatni a vizsg&aacute;latot, csak &eacute;ppen nem mondj&aacute;k meg, ki ellen, ez&eacute;rt elk&eacute;rik az &ouml;sszes titkos&iacute;t&oacute;kulcsomat. Ennek birtok&aacute;ban m&aacute;r minden levelez&eacute;semet el tudj&aacute;k olvasni; ha nem adom &aacute;t a kulcsokat, k&eacute;t &eacute;v b&ouml;rt&ouml;nt kock&aacute;ztatok. Ha pedig &eacute;rtes&iacute;tem a velem kapcsolatban &aacute;ll&oacute;kat, hogy v&aacute;ltoztass&aacute;k meg kulcsaikat, &eacute;rv&eacute;nybe l&eacute;p a figyelmeztet&eacute;sr&otilde;l sz&oacute;l&oacute; cikkely, &eacute;s a b&uuml;ntet&eacute;sem m&aacute;ris felmegy &ouml;t &eacute;vre. Mindezt m&eacute;g egy &uacute;js&aacute;g&iacute;r&oacute;nak sem szabad elmondani, mert az is b&ouml;rt&ouml;nbe juttat. Brit jogv&eacute;d&otilde; szervezetek m&aacute;ris tiltakoztak a tervezet ellen. (IDGNS, London)"</tt>

<p><table BORDER=0 CELLSPACING=0 CELLPADDING=0 WIDTH="100%">
<tr>
<td ALIGN=CENTER VALIGN=CENTER BGCOLOR="#000000"><font face="Arial, Helvetica, Verdana, Lucida"><font color="#FFFFFF"><font size=-2>&copy;
FLEISCHMANN Gy&ouml;rgy -&nbsp;</font></font></font><a href="contact.htm"><img SRC="../pics/html/mailto.gif" BORDER=0 height=10 width=14 ALIGN="absmiddle"></a></td>
</tr>
</table>

</BODY>

</HTML>
